aethaniel/ExperimentalCore-sam/tools/CMSIS_SVD/ATSAMD11D1xAx.svd
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPINTENSET%s</name>
          <description>DEVICE End Point Interrupt Set Flag</description>
          <addressOffset>0x109</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT</name>
              <description>Transfer Complete 0/1 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow 0/1 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXSTP</name>
              <description>Received Setup Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall In/out Interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPINTFLAG%s</name>
          <description>DEVICE End Point Interrupt Flag</description>
          <addressOffset>0x107</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT</name>
              <description>Transfer Complete 0/1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRFAIL</name>
              <description>Error Flow 0/1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RXSTP</name>
              <description>Received Setup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall In/out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUS%s</name>
          <description>DEVICE End Point Pipe Status</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle In</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLRQ</name>
              <description>STALL Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUSCLR%s</name>
          <description>DEVICE End Point Pipe Status Clear</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle OUT Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle IN Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Curren Bank Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ</name>
              <description>Stall Request Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUSSET%s</name>
          <description>DEVICE End Point Pipe Status Set</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle OUT Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle IN Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ</name>
              <description>STALL Request Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSMSTATUS</name>
          <description>Finite State Machine Status</description>
          <addressOffset>0x00D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>FSMSTATE</name>
              <description>Fine State Machine Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>FSMSTATESelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>ON (L0). It corresponds to the Idle and Active states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>SUSPEND (L2)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>SLEEP (L1)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DNRESUME</name>
                  <description>DNRESUME. Down Stream Resume.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPRESUME</name>
                  <description>UPRESUME. Up Stream Resume.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>RESET. USB lines Reset.</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCAL</name>
          <description>USB PAD Calibration</description>
          <addressOffset>0x028</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRANSP</name>
              <description>USB Pad Transp calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRANSN</name>
              <description>USB Pad Transn calibration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIM</name>
              <description>USB Pad Trim calibration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QOSCTRL</name>
          <description>USB Quality Of Service</description>
          <addressOffset>0x003</addressOffset>
          <size>8</size>
          <resetValue>0x05</resetValue>
          <fields>
            <field>
              <name>CQOS</name>
              <description>Configuration Quality of Service</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x002</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
